Repository: alialshishani/quran_sahaba
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Quran Sahaba
ar: قرآن الصحابة

source: Hello World!
ar: أهلاً بالعالم!

source: Reader
ar: القارئ

source: Khetmeh
ar: ختمة

source: Navigate
ar: تصفح

source: Statistics
ar: إحصائيات

source: Settings
ar: إعدادات

source: Navigate by Surah
ar: التنقل حسب السورة

# startsOnPage
source: Starts on page {page}
ar: تبدأ في صفحة {page}

source: Go to Surah
ar: اذهب إلى السورة

source: Navigate by Juz
ar: التنقل حسب الجزء

source: Juz
ar: الجزء

source: Go to Juz
ar: اذهب إلى الجزء

source: Navigate by Page
ar: التنقل حسب الصفحة

source: Page number
ar: رقم الصفحة

# enterPageNumber
source: Enter a page between 1 and 604
ar: أدخل صفحة بين 1 و 604

source: Go to Page
ar: اذهب إلى الصفحة

# invalidPageNumber
source: Please enter a valid page between 1 and {totalPages}
ar: يرجى إدخال صفحة صالحة بين 1 و {totalPages}

# khetmehPlan1Title
source: 30 Days
ar: 30 يومًا

# khetmehPlan1Subtitle
source: 1 juz per day
ar: 1 جزء في اليوم

# khetmehPlan1Range
source: Pages 1-604
ar: صفحات 1-604

# khetmehPlan2Title
source: 15 Days
ar: 15 يومًا

# khetmehPlan2Subtitle
source: 2 juz per day
ar: 2 جزء في اليوم

# khetmehPlan2Range
source: Pages 1-604 split in half
ar: صفحات 1-604 مقسمة إلى نصفين

# khetmehPlan3Title
source: Weekly
ar: أسبوعيًا

# khetmehPlan3Subtitle
source: ~4 juz per day
ar: ~ 4 أجزاء في اليوم

# khetmehPlan3Range
source: Finish every Friday
ar: إنهاء كل يوم جمعة

# statsPagesReadToday
source: Pages read today
ar: الصفحات المقروءة اليوم

# statsWeeklyAverage
source: Average pages per day (last 7 days)
ar: متوسط الصفحات في اليوم (آخر 7 أيام)

# statsOverallAverage
source: Overall daily average
ar: المتوسط اليومي الإجمالي

# statsRecentActivity
source: Recent activity
ar: النشاط الأخير

# statsPages
source: {count} pages
ar: {count} صفحات

# statsNoActivity
source: No reading activity recorded yet. Start reading to see stats!
ar: لم يتم تسجيل أي نشاط قراءة حتى الآن. ابدأ القراءة لترى الإحصائيات!

# aboutText
source: Swipe through the Quran PNG pages using the Reader tab. Use the arrows or tabs at the bottom to navigate.
ar: مرر عبر صفحات القرآن بتنسيق PNG باستخدام علامة تبويب القارئ. استخدم الأسهم أو علامات التبويب في الأسفل للتنقل.

source: Surah
ar: سورة

source: Language
ar: اللغة

source: Theme
ar: السمة

# khetmehPlan4Title
source: Sahaba Khetmeh
ar: ختمة الصحابة

# khetmehPlan4Subtitle
source: 7-day surah-based cycle
ar: دورة 7 أيام على أساس السور

# khetmehPlan4Range
source: Special daily surahs
ar: سور يومية خاصة

# khetmehPlan5Title
source: Free Roam
ar: تجوال حر

# khetmehPlan5Subtitle
source: Read at your own pace
ar: اقرأ بالسرعة التي تناسبك

# khetmehPlan5Range
source: No specific plan, just read.
ar: لا توجد خطة محددة ، فقط اقرأ.

# pagesRemaining
source: {count} pages remaining
ar: {count} صفحات متبقية

source: Expected completion: {date}
ar: التاريخ المتوقع للانتهاء: {date}

# pagesToReadToday
source: {count} pages to read today
ar: {count} صفحات للقراءة اليوم

# khetmehCompletions
source: {count} completions
ar: {count} إكمالات

# sahabaKhetmehDay
source: Day {day}: {surah}
ar: اليوم {day}: {surah}

source: Start
ar: ابدأ

source: Complete
ar: أكمل

source: End
ar: أنهِ

source: View completion history
ar: عرض سجل الإكمالات

source: Ahead of schedule
ar: متقدم على الجدول

source: Behind schedule
ar: متأخر عن الجدول

source: On track
ar: على المسار الصحيح

# todaysSurah
source: Today's surah: {surah}
ar: سورة اليوم: {surah}

# completionHistory
source: {title} - History
ar: {title} - السجل

# noCompletionHistory
source: No completion history yet.
ar: لا يوجد سجل إكمالات بعد.

# completedInDays
source: Completed in {count} {count, plural, =1{day} other{days}}
ar: تم الإكمال في {count} {count, plural, =1{يوم} other{أيام}}

# started
source: Started: {date}
ar: البداية: {date}

# finished
source: Finished: {date}
ar: الانتهاء: {date}

source: On target!
ar: على الهدف!

# daysAhead
source: {count} {count, plural, =1{day} other{days}} ahead
ar: {count} {count, plural, =1{يوم} other{أيام}} متقدم

# daysOver
source: {count} {count, plural, =1{day} other{days}} over
ar: {count} {count, plural, =1{يوم} other{أيام}} تأخير

source: Close
ar: إغلاق

source: Total Completions
ar: إجمالي الإكمالات

source: Bookmarks
ar: الإشارات المرجعية

source: Add Bookmark
ar: إضافة إشارة مرجعية

source: Remove Bookmark
ar: إزالة الإشارة المرجعية

source: Bookmark added
ar: تمت إضافة الإشارة المرجعية

source: Bookmark removed
ar: تمت إزالة الإشارة المرجعية

# noBookmarks
source: No bookmarks yet. Tap the bookmark icon while reading to save a page.
ar: لا توجد إشارات مرجعية حتى الآن. اضغط على أيقونة الإشارة المرجعية أثناء القراءة لحفظ صفحة.

# bookmarkNote
source: Note (optional)
ar: ملاحظة (اختياري)

# bookmarkLabel
source: Label (optional)
ar: تسمية (اختياري)

# saveBookmark
source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Edit Bookmark
ar: تعديل الإشارة المرجعية

source: Delete Bookmark
ar: حذف الإشارة المرجعية

source: Page
ar: صفحة

source: Reading Sessions
ar: جلسات القراءة

source: Current Session
ar: الجلسة الحالية

source: Total Reading Time
ar: إجمالي وقت القراءة

source: Average Session Time
ar: متوسط وقت الجلسة

source: Longest Session
ar: أطول جلسة

# statsSessionsToday
source: Sessions today
ar: الجلسات اليوم

# statsReadingTimeToday
source: Reading time today
ar: وقت القراءة اليوم

# minutes
source: {count} min
ar: {count} دقيقة

# hours
source: {count}h {minutes}m
ar: {count}س {minutes}د

source: Tasbih Counter
ar: عداد التسبيح

source: Reset
ar: إعادة تعيين

source: Count
ar: العدد

# showTasbih
source: Show Tasbih Counter
ar: إظهار عداد التسبيح

# tasbihCounterDescription
source: Display tasbih counter in reader
ar: عرض عداد التسبيح في القارئ

source: Tafseer
ar: التفسير

source: Tafseer Library
ar: مكتبة التفسير

source: Download Tafseer
ar: تحميل التفسير

source: Delete Tafseer
ar: حذف التفسير

source: Tafseer downloaded
ar: تم تحميل التفسير

source: Tafseer deleted
ar: تم حذف التفسير

source: Downloading tafseer...
ar: جاري تحميل التفسير...

# noTafseerAvailable
source: No tafseer available for this page
ar: لا يوجد تفسير متاح لهذه الصفحة

# noTafseerDownloaded
source: No tafseer downloaded yet. Download from Tafseer Library.
ar: لم يتم تحميل أي تفسير بعد. قم بالتحميل من مكتبة التفسير.

source: Select Tafseer
ar: اختر التفسير

source: Available Tafseers
ar: التفاسير المتاحة

source: Downloaded Tafseers
ar: التفاسير المحملة

# tafseerSize
source: Size: {size}
ar: الحجم: {size}

source: Download
ar: تحميل

source: Delete
ar: حذف

source: Viewing
ar: عرض

source: Show Tafseer
ar: إظهار التفسير

source: Hide Tafseer
ar: إخفاء التفسير

# tafseerForPage
source: Tafseer for Page {page}
ar: تفسير الصفحة {page}

source: Ayah
ar: الآية

# tafseerIbnKathir
source: Tafsir Ibn Kathir
ar: تفسير ابن كثير

# tafseerJalalayn
source: Tafsir al-Jalalayn
ar: تفسير الجلالين

# tafseerSaadi
source: Tafsir al-Sa'di
ar: تفسير السعدي

# tafseerMuyassar
source: Tafsir al-Muyassar
ar: التفسير الميسر

source: English Translation
ar: الترجمة الإنجليزية

source: Downloading...
ar: جاري التحميل...

source: Downloaded
ar: تم التحميل

source: Not Downloaded
ar: غير محمل
